#pragma once
void P61_situation()
{
	LanguageLib::LanguageTableT Language = {
		{"P61 6 situations of cracking and problems","P61 6种情况 裂和问题"},
		{"(1)1/1+2+1/2*3+1/3*4+……+1/99*100",
		"(1)1/1*2+1/2*3+1/3*4+……+1/99*100"},
		{"    1.First crack difference 1/1-1/2+1/2-1/3+1/3-1/4+...+1/99-1/100",
		"    1.先裂差 1/1-1/2+1/2-1/3+1/3-1/4+……+1/99-1/100"},
		{"    2. Offset similar items 1/1-1/100=99/100",
		"    2,抵消同类项 1/1-1/100=99/100"},
		{"(2)1/2+1/6+1/12+……+1/9900",
		"(2)1/2+1/6+1/12+……+1/9900"},
		{"    1.Split item yields 1/1 * 2+1/2 * 3+1/3 * 4+...+1/99 * 100",
		"    1.裂项得到1/1*2+1/2*3+1/3*4+……+1/99*100"},
		{"    2.First crack difference 1/1-1/2+1/2-1/3+1/3-1/4+...+1/99-1/100",
		"    2.先裂差 1/1-1/2+1/2-1/3+1/3-1/4+……+1/99-1/100"},
		{"    3. Offset similar items 1/1-1/100=99/100",
		"    3,抵消同类项 1/1-1/100=99/100"},
		{"(3)3/2+7/6+13/12+……+9901/9900",
		"(3)3/2+7/6+13/12+……+9901/9900"},
		{"    1. Convert the question to a number similar to 1 (1+1/2)+(1+1/6)+(1+1/12)+...+(1+1/9900)",
		"    1.把题目转换为和1相近的数 (1+1/2)+(1+1/6)+(1+1/12)+……+(1+1/9900)"},
		{"    2. Propose 1 * 99+(1/2)+(1/6)+(1/12)+...+(1/9900)",
		"    2.把1提出 1*99+(1/2)+(1/6)+(1/12)+……+(1/9900)"},
		{"    3.Split item yields 99+1/1 * 2+1/2 * 3+1/3 * 4+...+1/99 * 100",
		"    3.裂项得到99+1/1*2+1/2*3+1/3*4+……+1/99*100"},
		{"    4.First crack difference 99+1/1-1/2+1/2-1/3+1/3-1/4+...+1/99-1/100",
		"    4.先裂差 99+1/1-1/2+1/2-1/3+1/3-1/4+……+1/99-1/100"},
		{"    5. Offset similar items 99+1/1-1/100=99(99/100)",
		"    5,抵消同类项 99+1/1-1/100=99(99/100)"},
		{"(4)1/2+5/6+1/12+……+9899/9900",
		"(4)1/2+5/6+1/12+……+9899/9900"},
		{"    1. Convert the question to a number similar to 1 (1-1/2)+(1-1/6)+(1-1/12)+...+(1-1/9900)",
		"    1.把题目转换为和1相近的数 (1-1/2)+(1-1/6)+(1-1/12)+……+(1-1/9900)"},
		{"    2. Propose 1 * 99-(1/2)+(1/6)+(1/12)+...+(1/9900)",
		"    2.把1提出 1*99-(1/2)+(1/6)+(1/12)+……+(1/9900)"},
		{"    3.Split item yields 99-1/1 * 2+1/2 * 3+1/3 * 4+...+1/99 * 100",
		"    3.裂项得到99-1/1*2+1/2*3+1/3*4+……+1/99*100"},
		{"    4.First crack difference 99-1/1-1/2+1/2-1/3+1/3-1/4+...+1/99-1/100",
		"    4.先裂差 99-1/1-1/2+1/2-1/3+1/3-1/4+……+1/99-1/100"},
		{"    5. Offset similar items 99-1/1-1/100=97(99/100)",
		"    5,抵消同类项 99-1/1-1/100=97(99/100)"},
		{"(5)1+1/3+1/6+1/10+……+1/4950",
		"(5)1+1/3+1/6+1/10+……+1/4950"},
		{"    1. Convert the difference to a multiple of 2 * (1/2+1/6+1/12+...+1/9900)",
		"    1.把差转成倍数 2*(1/2+1/6+1/12+……+1/9900)"},
		{"    2. By substituting 2 into the second scenario, the same principle can be applied",
		"    2.把2带入第二种情况同理可得"},
		{"(6)1+1/1+2+1/1+2+3+1/1+2+3+4+……+1/1+2+3+4+……99",
		"(6)1+1/1+2+1/1+2+3+1/1+2+3+4+……+1/1+2+3+4+……99"},
		{"    1. Merge into scenario 5: 1+1/3+1/6+1/10+...+1/4950",
		"    1.合并成第5种情况 1+1/3+1/6+1/10+……+1/4950"},
		{"    2. In the fifth scenario, the same principle can be applied",
		"    2.第5种情况带入同理可得"},
	};
	Lang.AddLanguageTable(
		Language
	);
	ColPrintf(PrintfCol::标题, Lang("P61 6种情况 裂和问题"));
	ColPrintf(PrintfCol::标题, Lang("(1)1/1+2+1/2*3+1/3*4+……+1/99*100"));
	ColPrintf(PrintfCol::方法, Lang("    1.先裂差 1/1-1/2+1/2-1/3+1/3-1/4+……+1/99-1/100"));
	ColPrintf(PrintfCol::方法, Lang("    2,抵消同类项 1/1-1/100=99/100"));
	ColPrintf(PrintfCol::标题, Lang("(2)1/2+1/6+1/12+……+1/9900"));
	ColPrintf(PrintfCol::方法, Lang("    1.裂项得到1/1*2+1/2*3+1/3*4+……+1/99*100"));
	ColPrintf(PrintfCol::方法, Lang("    2.先裂差 1/1-1/2+1/2-1/3+1/3-1/4+……+1/99-1/100"));
	ColPrintf(PrintfCol::方法, Lang("    3,抵消同类项 1/1-1/100=99/100"));
	ColPrintf(PrintfCol::标题, Lang("(3)3/2+7/6+13/12+……+9901/9900"));
	ColPrintf(PrintfCol::方法, Lang("    1.把题目转换为和1相近的数 (1+1/2)+(1+1/6)+(1+1/12)+……+(1+1/9900)"));
	ColPrintf(PrintfCol::方法, Lang("    2.把1提出 1*99+(1/2)+(1/6)+(1/12)+……+(1/9900)"));
	ColPrintf(PrintfCol::方法, Lang("    3.裂项得到99+1/1*2+1/2*3+1/3*4+……+1/99*100"));
	ColPrintf(PrintfCol::方法, Lang("    4.先裂差 99+1/1-1/2+1/2-1/3+1/3-1/4+……+1/99-1/100"));
	ColPrintf(PrintfCol::方法, Lang("    5,抵消同类项 99+1/1-1/100=99(99/100)"));
	ColPrintf(PrintfCol::标题, Lang("(4)1/2+5/6+1/12+……+9899/9900"));
	ColPrintf(PrintfCol::方法, Lang("    1.把题目转换为和1相近的数 (1-1/2)+(1-1/6)+(1-1/12)+……+(1-1/9900)"));
	ColPrintf(PrintfCol::方法, Lang("    2.把1提出 1*99-(1/2)+(1/6)+(1/12)+……+(1/9900)"));
	ColPrintf(PrintfCol::方法, Lang("    3.裂项得到99+1/1*2+1/2*3+1/3*4+……+1/99*100"));
	ColPrintf(PrintfCol::方法, Lang("    4.先裂差 99+1/1-1/2+1/2-1/3+1/3-1/4+……+1/99-1/100"));
	ColPrintf(PrintfCol::方法, Lang("    5,抵消同类项 99-1/1-1/100=97(99/100)"));
	ColPrintf(PrintfCol::标题, Lang("(5)1+1/3+1/6+1/10+……+1/4950"));
	ColPrintf(PrintfCol::方法, Lang("    1.把差转成倍数 2*(1/2+1/6+1/12+……+1/9900)"));
	ColPrintf(PrintfCol::方法, Lang("    2.把2带入第二种情况同理可得"));
	ColPrintf(PrintfCol::标题, Lang("(6)1+1/1+2+1/1+2+3+1/1+2+3+4+……+1/1+2+3+4+……99"));
	ColPrintf(PrintfCol::方法, Lang("    1.合并成第5种情况 1+1/3+1/6+1/10+……+1/4950"));
	ColPrintf(PrintfCol::方法, Lang("    2.第5种情况带入同理可得"));
}
void P61_1()
{
	LanguageLib::LanguageTableT Language = {
		{"P61 case of eight cracks and problems","P61例八 裂和问题"},
		{"Title: Calculate 1/2+5/6+11/12+19/20+...+89/90+109/110",
		"题目：计算1/2+5/6+11/12+19/20+……+89/90+109/110"},
		{"1. Convert each term of the formula into a form similar to 1/1 * 2+5/2 * 3+11/3 * 4+19/4 * 5+...+89/9 * 10+109/10 * 11",
		"1.把式子裂项 1/1*2+5/2*3+11/3*4+19/4*5+……+89/9*10+109/10*11"},
		{"2. Change the Chinese character in the question to 1-1/2+1-1/6+1-1/12+1-1/20+...+1-1/90+1-1/110",
		"2.把题目中式子改成与1相近的 1-1/2+1-1/6+1-1/12+1-1/20+...+1-1/90+1-1/110"},
		{"3. Present 1 in the equation as 1 * 10- (1/2+1/6+1/12+1/20+...+1/90+1/110)",
		"3.把式子中的1提出 1*10-(1/2+1/6+1/12+1/20+...+1/90+1/110)"},
		{"4. According to step 1, enter step 3 with a crack difference of 1 * 10- (1/1-1/2+5/2-1/3+11/3-1/4+19/4-1/5+...+89/9-1/10+109/10-1/11)",
		"4.根据第1步带入第3步裂差 1*10-(1/1-1/2+5/2-1/3+11/3-1/4+19/4-1/5+……+89/9-10/10+109/10-1/11)"},
		{"5. Offset similar items 1 * 10- (1/1-1/11)=9 (1/11)",
		"5.抵消同类项 1*10-(1/1-1/11)=9(1/11)"},
	};
	Lang.AddLanguageTable(
		Language
	);
	ColPrintf(PrintfCol::标题, Lang("P61例八 裂和问题"));
	ColPrintf(PrintfCol::标题, Lang("题目：计算1/2+5/6+11/12+19/20+……+89/90+109/110"));
	ColPrintf(PrintfCol::方法, Lang("1.把式子裂项 1/1*2+5/2*3+11/3*4+19/4*5+……+89/9*10+109/10*11"));
	ColPrintf(PrintfCol::方法, Lang("2.把题目中式子改成与1相近的 1-1/2+1-1/6+1-1/12+1-1/20+...+1-1/90+1-1/110"));
	ColPrintf(PrintfCol::方法, Lang("3.把式子中的1提出 1*10-(1/2+1/6+1/12+1/20+...+1/90+1/110)"));
	ColPrintf(PrintfCol::方法, Lang("4.根据第1步带入第3步裂差 1*10-(1/1-1/2+5/2-1/3+11/3-1/4+19/4-1/5+……+89/9-10/10+109/10-1/11)"));
	ColPrintf(PrintfCol::方法, Lang("5.抵消同类项 1*10-(1/1-1/11)=9(1/11)"));
}
void P61_2()
{
	LanguageLib::LanguageTableT Language = {
		{"P61 Case Nine Cracks and Problems","P61例九 裂和问题"},
		{"Title: Calculate 1+1/1+2+1/1+2+3+1/1+2+3+1+2+3+4+1/1+2+3+4+5+...+1/1+2+3+4+6+...+50",
		"题目：计算1+1/1+2+1/1+2+3+1/1+2+3+4+1/1+2+3+4+5+……+1/1+2+3+4+6+……+50"},
		{"1. Simplify equation 1+1/3+1/6+1/10+... 1/1275",
		"1.化简式子 1+1/3+1/6+1/10+……1/1275"},
		{"2. Make the difference between the splitting terms in the equation equal to molecule 2 * (1/2+1/6+1/12+1/20+... 1/2550)",
		"2.使式子中的项的差等于分子 2*(1/2+1/6+1/12+1/20+……1/2550)"},
		{"3. Split Item 2 * (1/(1 * 2)+1/(2 * 3)+1/(3 * 4)+1/(4 * 5)+... 1/(50 * 51))",
		"3.裂项 2*(1/(1*2)+1/(2*3)+1/(3*4)+1/(4*5)+……1/(50*51))"},
		{"4. Crack difference 2 * (1/1-1/2+1/2-1/3+1/3-1/4)+1/4-1/5)+... 1/50-1/51)",
		"4.裂差 2*(1/1-1/2+1/2-1/3+1/3-1/4)+1/4-1/5)+……1/50-1/51)"},
		{"5. Offset similar items 2 * (1-1/51)=2 * 1-2 * 1/51=100/51",
		"5.抵消同类项 2*(1-1/51)=2*1-2*1/51=100/51"},
	};
	Lang.AddLanguageTable(
		Language
	);
	ColPrintf(PrintfCol::标题, Lang("P61例九 裂和问题"));
	ColPrintf(PrintfCol::标题, Lang("题目：计算1+1/1+2+1/1+2+3+1/1+2+3+4+1/1+2+3+4+5+……+1/1+2+3+4+6+……+50"));
	ColPrintf(PrintfCol::方法, Lang("1.化简式子 1+1/3+1/6+1/10+……1/1275"));
	ColPrintf(PrintfCol::方法, Lang("2.使式子中的项的差等于分子 2*(1/2+1/6+1/12+1/20+……1/2550)"));
	ColPrintf(PrintfCol::方法, Lang("3.裂项 2*(1/(1*2)+1/(2*3)+1/(3*4)+1/(4*5)+……1/(50*51))"));
	ColPrintf(PrintfCol::方法, Lang("4.裂差 2*(1/1-1/2+1/2-1/3+1/3-1/4)+1/4-1/5)+……1/50-1/51)"));
	ColPrintf(PrintfCol::方法, Lang("5.抵消同类项 2*(1-1/51)=2*1-2*1/51=100/51"));
}
void P61()
{
	P61_situation();
	ColPrintf(PrintfCol::方法, "");
	P61_1();
	ColPrintf(PrintfCol::方法, "");
	P61_2();
	ColPrintf(PrintfCol::方法, "");
}
void P61_mian()
{
	Lang.SetCurLanguage(LanguageLib::Chinese);
	P61();
	Lang.SetCurLanguage(LanguageLib::English);
	P61();
	ColPrintf(PrintfCol::方法, "");

}